Autodesk.Revit.Utility.AssetProperty.SetReadOnlyInternal(System.Boolean)
Set the read-only property of the object.

Autodesk.Revit.Utility.AssetProperty.GetConnectedPropertiesNames
Gets names of all connected properties.
Returns:
A list of the names of the connected properties.
Since:
2014

Autodesk.Revit.Utility.AssetProperty.GetAllConnectedProperties
Gets the list of the connected properties.
Connected properties are the detachable properties of an AssetProperty.
e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
Returns:
A list of the connected properties.
Since:
2014

Autodesk.Revit.Utility.AssetProperty.GetConnectedProperty(System.String)
Gets a connected property by its name.
Remarks:
Returns NULL is there is no connected property with the specified name.
name:
Name of the property.
Returns:
The property with the specified name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.Utility.AssetProperty.GetConnectedProperty(System.Int32)
Gets one connected property with specified index.
Returns:
The AProperty of that index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is out of range.
Since:
2014

Autodesk.Revit.Utility.AssetProperty.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.Utility.AssetProperty.IsReadOnly
Identifies if the object is read-only or modifiable.
If true, the object may not be modified.  If false, the object's contents may be modified.

Autodesk.Revit.Utility.AssetProperty.NumberOfConnectedProperties
The number of currently connected properties.
Since:
2014

Autodesk.Revit.Utility.AssetProperty.GetTypeName(Autodesk.Revit.Utility.AssetPropertyType)
Get the name of the AssetProperty
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when type is AssetPropertyType::APT_Unknown.

Autodesk.Revit.Utility.AssetProperty.Type
Returns the type of the AssetProperty

Autodesk.Revit.Utility.AssetProperty.Name
Get the name of the AssetProperty

Autodesk.Revit.Utility.AssetProperty
Represents a property of material.
Remarks:
AssetProperty is the base class or all other AssetProperty sub classes.